; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite3 - satellite
	instrument9 - instrument
	thermograph0 - mode
	spectrograph1 - mode
	thermograph3 - mode
	image2 - mode
	Star0 - direction
	GroundStation3 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	Phenomenon4 - direction
	Star5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
)
(:init
	(supports instrument0 thermograph3)
	(supports instrument0 image2)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 image2)
	(supports instrument1 spectrograph1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star0)
	(supports instrument2 spectrograph1)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 176)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 image2)
	(supports instrument4 spectrograph1)
	(supports instrument4 thermograph3)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 image2)
	(supports instrument5 spectrograph1)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 GroundStation3)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 124)
	(supports instrument6 spectrograph1)
	(supports instrument6 image2)
	(calibration_target instrument6 GroundStation2)
	(supports instrument7 thermograph0)
	(supports instrument7 thermograph3)
	(calibration_target instrument7 GroundStation1)
	(supports instrument8 thermograph3)
	(calibration_target instrument8 GroundStation2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon7)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 177)
	(supports instrument9 image2)
	(supports instrument9 thermograph3)
	(supports instrument9 spectrograph1)
	(calibration_target instrument9 GroundStation1)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation1)
	(= (data_capacity satellite3) 1000)
	(= (fuel satellite3) 153)
	(= (data Phenomenon4 thermograph0) 216)
	(= (data Star5 thermograph0) 56)
	(= (data Phenomenon6 thermograph0) 161)
	(= (data Phenomenon7 thermograph0) 250)
	(= (data Phenomenon8 thermograph0) 67)
	(= (data Phenomenon4 spectrograph1) 62)
	(= (data Star5 spectrograph1) 178)
	(= (data Phenomenon6 spectrograph1) 228)
	(= (data Phenomenon7 spectrograph1) 299)
	(= (data Phenomenon8 spectrograph1) 294)
	(= (data Phenomenon4 thermograph3) 37)
	(= (data Star5 thermograph3) 157)
	(= (data Phenomenon6 thermograph3) 146)
	(= (data Phenomenon7 thermograph3) 122)
	(= (data Phenomenon8 thermograph3) 235)
	(= (data Phenomenon4 image2) 128)
	(= (data Star5 image2) 8)
	(= (data Phenomenon6 image2) 23)
	(= (data Phenomenon7 image2) 211)
	(= (data Phenomenon8 image2) 97)
	(= (slew_time GroundStation3 Star0) 34.68)
	(= (slew_time Star0 GroundStation3) 34.68)
	(= (slew_time GroundStation3 GroundStation1) 34.9)
	(= (slew_time GroundStation1 GroundStation3) 34.9)
	(= (slew_time GroundStation3 GroundStation2) 27.1)
	(= (slew_time GroundStation2 GroundStation3) 27.1)
	(= (slew_time GroundStation2 Star0) 38.62)
	(= (slew_time Star0 GroundStation2) 38.62)
	(= (slew_time GroundStation2 GroundStation1) 44.49)
	(= (slew_time GroundStation1 GroundStation2) 44.49)
	(= (slew_time GroundStation1 Star0) 53.41)
	(= (slew_time Star0 GroundStation1) 53.41)
	(= (slew_time Phenomenon4 Star0) 4.44)
	(= (slew_time Star0 Phenomenon4) 4.44)
	(= (slew_time Phenomenon4 GroundStation1) 6.01)
	(= (slew_time GroundStation1 Phenomenon4) 6.01)
	(= (slew_time Phenomenon4 GroundStation2) 27.35)
	(= (slew_time GroundStation2 Phenomenon4) 27.35)
	(= (slew_time Phenomenon4 GroundStation3) 55.18)
	(= (slew_time GroundStation3 Phenomenon4) 55.18)
	(= (slew_time Star5 Star0) 31.12)
	(= (slew_time Star0 Star5) 31.12)
	(= (slew_time Star5 GroundStation1) 7.802)
	(= (slew_time GroundStation1 Star5) 7.802)
	(= (slew_time Star5 GroundStation2) 17.93)
	(= (slew_time GroundStation2 Star5) 17.93)
	(= (slew_time Star5 GroundStation3) 8.995)
	(= (slew_time GroundStation3 Star5) 8.995)
	(= (slew_time Star5 Phenomenon4) 17.62)
	(= (slew_time Phenomenon4 Star5) 17.62)
	(= (slew_time Phenomenon6 Star0) 58.16)
	(= (slew_time Star0 Phenomenon6) 58.16)
	(= (slew_time Phenomenon6 GroundStation1) 5.075)
	(= (slew_time GroundStation1 Phenomenon6) 5.075)
	(= (slew_time Phenomenon6 GroundStation2) 30.74)
	(= (slew_time GroundStation2 Phenomenon6) 30.74)
	(= (slew_time Phenomenon6 GroundStation3) 34.25)
	(= (slew_time GroundStation3 Phenomenon6) 34.25)
	(= (slew_time Phenomenon6 Phenomenon4) 17.45)
	(= (slew_time Phenomenon4 Phenomenon6) 17.45)
	(= (slew_time Phenomenon6 Star5) 54.09)
	(= (slew_time Star5 Phenomenon6) 54.09)
	(= (slew_time Phenomenon7 Star0) 14.25)
	(= (slew_time Star0 Phenomenon7) 14.25)
	(= (slew_time Phenomenon7 GroundStation1) 79.42)
	(= (slew_time GroundStation1 Phenomenon7) 79.42)
	(= (slew_time Phenomenon7 GroundStation2) 51.24)
	(= (slew_time GroundStation2 Phenomenon7) 51.24)
	(= (slew_time Phenomenon7 GroundStation3) 48.75)
	(= (slew_time GroundStation3 Phenomenon7) 48.75)
	(= (slew_time Phenomenon7 Phenomenon4) 38.07)
	(= (slew_time Phenomenon4 Phenomenon7) 38.07)
	(= (slew_time Phenomenon7 Star5) 36.21)
	(= (slew_time Star5 Phenomenon7) 36.21)
	(= (slew_time Phenomenon7 Phenomenon6) 23.14)
	(= (slew_time Phenomenon6 Phenomenon7) 23.14)
	(= (slew_time Phenomenon8 Star0) 22.81)
	(= (slew_time Star0 Phenomenon8) 22.81)
	(= (slew_time Phenomenon8 GroundStation1) 23.29)
	(= (slew_time GroundStation1 Phenomenon8) 23.29)
	(= (slew_time Phenomenon8 GroundStation2) 59.53)
	(= (slew_time GroundStation2 Phenomenon8) 59.53)
	(= (slew_time Phenomenon8 GroundStation3) 67.9)
	(= (slew_time GroundStation3 Phenomenon8) 67.9)
	(= (slew_time Phenomenon8 Phenomenon4) 12.26)
	(= (slew_time Phenomenon4 Phenomenon8) 12.26)
	(= (slew_time Phenomenon8 Star5) 40.57)
	(= (slew_time Star5 Phenomenon8) 40.57)
	(= (slew_time Phenomenon8 Phenomenon6) 41.25)
	(= (slew_time Phenomenon6 Phenomenon8) 41.25)
	(= (slew_time Phenomenon8 Phenomenon7) 10.14)
	(= (slew_time Phenomenon7 Phenomenon8) 10.14)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Phenomenon4 spectrograph1)
	(have_image Star5 thermograph3)
	(have_image Phenomenon6 spectrograph1)
	(have_image Phenomenon7 image2)
	(have_image Phenomenon8 thermograph0)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite2 groundstation1 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 groundstation1)
   changed: (fuel satellite2) from 177 to 97.58, (fuel-used) from 0 to 79.42
   goals met: 0 of 5
2. (switch_on instrument9 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument9)
   goals met: 0 of 5
3. (turn_to satellite2 phenomenon8 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 phenomenon8)
   changed: (fuel satellite2) from 97.58 to 74.29, (fuel-used) from 79.42 to 102.71
   goals met: 0 of 5
4. (switch_on instrument7 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument7)
   goals met: 0 of 5
5. (turn_to satellite2 groundstation1 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 groundstation1)
   changed: (fuel satellite2) from 74.29 to 51, (fuel-used) from 102.71 to 126
   goals met: 0 of 5
6. (calibrate satellite2 instrument7 groundstation1)
   added: (calibrated instrument7)
   goals met: 0 of 5
7. (turn_to satellite2 phenomenon8 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 phenomenon8)
   changed: (fuel satellite2) from 51 to 27.71, (fuel-used) from 126 to 149.29
   goals met: 0 of 5
8. (calibrate satellite3 instrument9 groundstation1)
   added: (calibrated instrument9)
   goals met: 0 of 5
9. (turn_to satellite3 phenomenon4 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 phenomenon4)
   changed: (fuel satellite3) from 153 to 146.99, (fuel-used) from 149.29 to 155.3
   goals met: 0 of 5
10. (turn_to satellite3 groundstation1 phenomenon4)
   deleted: (pointing satellite3 phenomenon4)
   added: (pointing satellite3 groundstation1)
   changed: (fuel satellite3) from 146.99 to 140.98, (fuel-used) from 155.3 to 161.31
   goals met: 0 of 5
11. (turn_to satellite3 phenomenon4 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 phenomenon4)
   changed: (fuel satellite3) from 140.98 to 134.97, (fuel-used) from 161.31 to 167.32
   goals met: 0 of 5
12. (take_image satellite3 phenomenon4 instrument9 spectrograph1)
   added: (have_image phenomenon4 spectrograph1)
   changed: (data_capacity satellite3) from 1000 to 938, (data-stored) from 0 to 62
   goals met: 1 of 5
13. (turn_to satellite3 phenomenon6 phenomenon4)
   deleted: (pointing satellite3 phenomenon4)
   added: (pointing satellite3 phenomenon6)
   changed: (fuel satellite3) from 134.97 to 117.52, (fuel-used) from 167.32 to 184.77
   goals met: 1 of 5
14. (take_image satellite3 phenomenon6 instrument9 spectrograph1)
   added: (have_image phenomenon6 spectrograph1)
   changed: (data_capacity satellite3) from 938 to 710, (data-stored) from 62 to 290
   goals met: 2 of 5
15. (turn_to satellite3 phenomenon7 phenomenon6)
   deleted: (pointing satellite3 phenomenon6)
   added: (pointing satellite3 phenomenon7)
   changed: (fuel satellite3) from 117.52 to 94.38, (fuel-used) from 184.77 to 207.91
   goals met: 2 of 5
16. (take_image satellite2 phenomenon8 instrument7 thermograph0)
   added: (have_image phenomenon8 thermograph0)
   changed: (data_capacity satellite2) from 1000 to 933, (data-stored) from 290 to 357
   goals met: 3 of 5
17. (turn_to satellite2 phenomenon4 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 phenomenon4)
   changed: (fuel satellite2) from 27.71 to 15.45, (fuel-used) from 207.91 to 220.17
   goals met: 3 of 5
18. (turn_to satellite2 groundstation1 phenomenon4)
   deleted: (pointing satellite2 phenomenon4)
   added: (pointing satellite2 groundstation1)
   changed: (fuel satellite2) from 15.45 to 9.44, (fuel-used) from 220.17 to 226.18
   goals met: 3 of 5
19. (turn_to satellite2 star5 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 star5)
   changed: (fuel satellite2) from 9.44 to 1.638, (fuel-used) from 226.18 to 233.982
   goals met: 3 of 5
20. (take_image satellite2 star5 instrument7 thermograph3)
   added: (have_image star5 thermograph3)
   changed: (data_capacity satellite2) from 933 to 776, (data-stored) from 357 to 514
   goals met: 4 of 5
21. (take_image satellite3 phenomenon7 instrument9 image2)
   added: (have_image phenomenon7 image2)
   changed: (data_capacity satellite3) from 710 to 499, (data-stored) from 514 to 725
   goals met: 5 of 5
